#问卷的ID
ID = 81485163

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 300

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,1,0,1,1, 4,1,1,1,0, 1,0,0,0,0]

#每一题有多少个选项
SELECTION_COUNT = [2,6,4,4,2, 5,6,4,6,11, 5,8,6,5,4, 6,5,3,5,3]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[40,60],[8,34,26,21,9,2],[22,39,28,11],[38,22,16,24],[53,47],
[15,26,34,16,9],[24,32,14,17,7,6],[29,41,12,18],[64,37,52,36,21,14],[43,24,11,28,27,26,32,42,22,18,11],
[[9,11,20,23,37],[8,9,17,25,41],[7,11,21,23,38],[6,12,17,32,33],[14,24,30,18,14],[13,25,31,20,11]],
[53,28,39,31,32,28,29,21],[42,27,39,20,43,19],[47,16,15,28,9],[39,36,17,8],
[42,34,21,53,22,6],[9,23,36,21,11],[49,20,31],[8,3,3,4,82],[52,18,30]
]

#成功数量
SUCCESS_TIMES = 0
