#问卷的ID
ID = 81915049

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =24

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,0, 0,3,0,0,3, 0,0,0,0,0, 0,0,0,0,1, 0,1]

#每一题有多少个选项
SELECTION_COUNT = [2,2,6,2,6, 6,0,2,2,0, 4,5,5,4,3, 3,2,2,5,5, 6,7]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [0,100],[15,85],[20,30,20,15,10,5],[60,40],[30,30,5,20,5,10],
    [10,15,35,20,15,5],['辽宁','山东','东北','黑龙江','河北','江苏','安徽','浙江','湖北'],[70,30],[60,40],['5000','4000','3000','2000','1000','5000以下'],
    [25,30,5,40],[80,10,5,5,0],[25,40,15,5,15],[30,40,20,10],[20,60,20],
    [75,20,5],[70,30],[80,20],[30,10,30,20,10],[60,30,30,30,10],[30,50,30,20,20,5],
    [40,40,50,30,10,20,10]
]

#成功数量
SUCCESS_TIMES = 0
