#问卷的ID
ID = 80564169

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 5

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,0, 0,3,1,1,1, 1,1,1,1,1, 1,1,1,1,1, 1]

#每一题有多少个选项
SELECTION_COUNT = [2,4,6,7,4, 4,0,5,4,5, 5,3,4,4,4, 4,4,4,4,4, 4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[35,65],[0,50,50,0],[0,0,0,100,0,0],[96,0,0,4,0,0,0],[0,0,50,50],
[4,32,32,32],["无","没有","不影响","还好吧","，没有影响"],[25,25,25,25,0],[32,32,32,4],[32,32,32,32,4],
[32,32,32,32,4],[50,50,0],[32,32,32,4],[33,33,33,0],[25,25,25,25],
[33,33,33,0],[25,25,25,25],[32,32,32,4],[25,25,25,25],[33,33,33,0],[25,25,25,25]
]

#成功数量
SUCCESS_TIMES=0
