#问卷的ID
ID = 75472422

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 100

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空
QUESTION_TYPE = [3,0,1,0,1, 0,0,0,1,0, 1,0,0,0,0, 0,1,1,3]

#每一题有多少个选项
SELECTION_COUNT = [0,5,7,3,10, 4,3,9,6,5, 7,2,7,2,4, 2,6,5,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [["法学","医学","文学","农业","电气","机械","土建","化工","哲学","管理学","计算机"],[30,20,10,30,10],[10,30,10,10,10,30,0],[20,40,40],[40,30,30,10,10,20,20,20,0,10],
[20,40,30,10],[40,20,30],[20,10,10,10,10, 10,10,10,10],[30,10,30,10,20,10],[10,30,10,40,10],
[40,30,20,30,20,10,5],[60,40],[20,20,30,20,5,5,0],[60,30],[60,20,20,10],
[40,60],[30,30,30,20,40,30],[50,30,20,30,10],["无"]
]

#成功数量
SUCCESS_TIMES=0
