#问卷的ID
ID = 81338115

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 10

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空
QUESTION_TYPE = [0,0,0,0,0, 0,0,1]

#每一题有多少个选项
SELECTION_COUNT = [2,4,4,4,4, 4,4,6]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[33,67],[20,50,10,20],[14,39,40,7],[23,53,20,4],[18,20,52,10],
[10,30,40,20],[53,26,10,11],[80,32,80,60,39,40]
]

#成功数量
SUCCESS_TIMES = 0
