#问卷的ID
ID = 84791251

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =100

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,0]

#每一题有多少个选项
SELECTION_COUNT = [2,2,6,5,4, 3,3,3,4,3, 4,4,3,3,5]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [42,58],[70,30],[15,23,16,12,25,9],[12,26,42,11,9],[58,26,11,5],
    [85,9,6],[76,16,8],[16,38,46],[43,12,26,19],[56,16,28],
    [33,39,12,16],[16,53,10,21],[21,46,33],[32,52,16],[35,10,26,16,13]

]

#成功数量
SUCCESS_TIMES = 0
