#问卷的ID
ID = 78767697

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 1

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'r'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,0, 0, 0,0,0,0,0, 0,0,0]

#每一题有多少个选项
SELECTION_COUNT = [5,5,5,5,5, 5,5,5,5,5, 5,5,5,5,5, 5,5,5]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[80,10,10,0,0],
[10,40,40,0,0],[10,40,40,0,0],[10,40,40,0,0],[10,40,40,0,0],[10,40,40,0,0],[10,40,40,0,0],[10,40,40,0,0],
[10,10,60,10,10],
[0,0,10,10,80],
[0,0,40,40,10],[0,0,40,40,10],[0,0,40,40,10],[0,0,40,40,10],[0,0,40,40,10],[0,0,40,40,10],[0,0,40,40,10],
[10,10,60,10,10]
]

#成功数量
SUCCESS_TIMES=0

answer1=["无","没有","暂时没有","暂无"]
answer2=["希望政府可以出台相应的政策法律,用以监管网购快递包装循环利用情况","菜鸟驿站在今后发展中提高服务质量,宣传包装回收利用知识","无"]
