#问卷的ID
ID = 80772349

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 5

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,0, 0,0,1,1,0, 1]

#每一题有多少个选项
SELECTION_COUNT = [7,2,5,5,5, 2,5,13,10,2, 9]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[5,59,20,10,4,1,1],[45,55],[10,15,5,50,20],[5,20,40,15,20],[3,24,55,16,2],
[6,94],[2,20,22,45,11],[10,1,18,16,16,8,12,4,3,3,1,7,1],[36,30,10,5,3,8,1,3,2,2],[0,100],
[19,23,18,8,4,4,3,1,20]
]

#成功数量
SUCCESS_TIMES=0
