#问卷的ID
ID = 83914869

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =100

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,1, 1,1,0,1,0, 0,0,0,0]

#每一题有多少个选项
SELECTION_COUNT = [2,3,4,4,9, 9,6,3,4,3, 3,3,5,3]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [60,40],[30,40,30],[0,100,0,0],[60,20,10,10],[70,80,70,50,20,20,20,20,10],
    [70,70,40,30,20,20,20,20,60],[20,70,40,70,30,10],[70,20,10],[90,60,40,20],[20,20,60],
    [30,50,20],[30,50,20],[5,10,30,35,20],[20,50,30]
]

#成功数量
SUCCESS_TIMES = 0
