#问卷的ID
ID = 83776985

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =25

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,1,4, 4,4]

#每一题有多少个选项
SELECTION_COUNT = [2,6,4,7,2, 2,5,3,5,5, 5,5]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [40,60],[0,0,90,5,5,0],[10,40,40,10],[0,10,10,60,10,10,0],[70,30],
    [70,30],[20,40,30,5,5],[20,30,50],[50,50,50,0,0],
    [[10,10,30,30,20],[5,5,20,30,40],[20,30,30,20,0]],
    [[30,35,20,10,5],[10,20,50,10,10],[10,20,50,10,10],[50,30,10,10,0],[20,30,30,15,5]],
    [[5,15,10,40,30],[5,15,10,30,40],[5,15,10,30,40],
    [5,15,10,30,50],[5,5,20,30,35],[5,5,20,35,30],
    [5,15,20,50,30],[5,15,20,50,30],
    [5,15,20,30,50],[5,15,20,30,50],[5,15,20,50,30]]
]

#成功数量
SUCCESS_TIMES = 0
