#问卷的ID
ID = 80996132

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 5

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空
QUESTION_TYPE = [0,0,0,0,0, 0,1,1,0,0, 0,0,0,0,0, 0]

#每一题有多少个选项
SELECTION_COUNT = [2,6,4,4,2, 2,5,5,2,2, 2,4,4,4,5, 4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[52,48],[1,40,30,25,3,1],[35,43,20,2],[0,14,30,56],[64,36],
[60,40],[50,67,64,51,23],[51,72,58,40,9],[74,26],[70,30],
[77,23],[21,38,38,3],[17,49,25,9],[13,42,35,10],[14,24,46,14,2],
[20,40,27,13]
]

#成功数量
SUCCESS_TIMES = 0
