#问卷的ID
ID = 81351000

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 50

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,1,0, 0,1,0,4,4, 4,3]

#每一题有多少个选项
SELECTION_COUNT = [2,5,7,2,4, 5,5,5,7,3, 5,6,3,4,5, 5,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [50,50],[15,30,30,20,5],[35,30,2,20,5,5,3],[45,55],[2,45,45,8],
    [15,60,18,5,2],[12,48,25,13,2],[7,45,33,13,2],[37,73,20,8,52,15,8],[50,10,40],
    [30,30,22,14,4],[68,62,50,52,26,0],[60,20,20],
    [[5,15,20,60],[75,5,15,5],[10,65,15,5],[15,5,70,10]],
    [[35,35,15,10,5],[50,30,10,8,2],[40,35,15,8,2],[40,35,15,7,3],[40,30,15,13,2]],
    [[25,49,14,10,2],[20,50,20,9,1],[28,33,25,12,2],[30,45,15,8,2]],
    ["提供自己实践能力","好好学习","理性面对","丰富自己","拥有竞争力","努力学习","掌握核心能力","调整心态","找到自己的优势长处"]
]

#成功数量
SUCCESS_TIMES = 0
