#问卷的ID
ID = 82104135

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 150

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,1,0, 0,1,1,0,1, 0,1]

#每一题有多少个选项
SELECTION_COUNT = [2,5,3,4,3, 4,3,2,3,3, 3,4,4,3,6, 3,4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [74,26],[13,12,13,40,22],[83,13,4],[29,47,16,8],[40,54,6],
    [14,30,49,7],[34,50,16],[40,60],[81,34,56],[23,48,28],
    [17,13,63],[84,78,69,22],[50,72,59,72],[6,19,75],[72,78,87,65,62,6],
    [62,31,6],[82,59,90,22]
]

#成功数量
SUCCESS_TIMES = 0
