#问卷的ID
ID = 80163755

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =2

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,1,1, 0,0,4,3,5]

#每一题有多少个选项
SELECTION_COUNT = [5,5,4,4,4, 5,5,5,0,4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [83,5,0,11,1],[25,45,10,15,5],[1,20,60,19],[98,92,6,20],[92,87,35,25],
    [10,67,20,1,2],[10,33,37,15,5],
    [[5,5,22,40,28],[0,5,15,55,25],[5,5,35,40,15]],
    [],[['女'],['20'],['本科'],['成都理工大学']]
]

#成功数量
SUCCESS_TIMES = 0
