#问卷的ID
ID = 83806910

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =20

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,1, 0,0,0,0,0, 0,0,0]

#每一题有多少个选项
SELECTION_COUNT = [4,4,5,5,7, 5,8,5,2,7, 9,5,4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [30,30,30,10],[10,10,30,50],[10,40,10,10,30],[20,30,10,30,10],[50,60,40,30,30,30,40],
    [40,30,15,10,5],[5,10,40,20,10,5,5,5],[30,10,40,10,10],[40,60],[10,30,40,10,5,5,0],
    [5,5,5,20,10,40,5,5,5],[35,30,20,10,5],[10,40,40,10]
]

#成功数量
SUCCESS_TIMES = 0
