#问卷的ID
ID = 82301921

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 45

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 2,0,1,0,0, 1,2,4,0,3]

#每一题有多少个选项
SELECTION_COUNT = [4,2,5,5,2, 8,6,8,5,5, 5,6,5,3,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [10,20,40,30],[40,60],[0,20,45,30,5],[30,40,10,10,10],[98,2],
    ["1","2","3","4","5","6","7","8"],[20,40,30,5,5,0],[60,50,60,60,50,70,70,10],[10,20,30,20,10],[10,0,70,10,10],
    [20,60,70,60,10],["1","2","3","4","5","6"],
    [[10,10,40,30,10],[10,10,50,20,10],[0,10,50,20,20],[0,0,40,40,20]],
    [35,45,20],['无','不知道']
]

#成功数量
SUCCESS_TIMES = 0
