#问卷的ID
ID = 85250812

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =50

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,3,0,0,1, 1,1,1,1,0, 1,1,1,0,1, 0,1,1,3]

#每一题有多少个选项
SELECTION_COUNT = [6,0,12,5,9, 7,5,4,9,6, 7,6,10,8,5, 8,9,13,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [0,0,100,0,0,0],['中国政法大学，法学'],[0,0,0,0,0,60,40,0,0,0,0,0],[5,60,30,5,0],[80,50,20,20,30,10,20,10,0],
    [30,50,30,40,50,50,0],[50,40,80,70,0],[30,30,70,20],[10,20,20,20,10,10,80,0,0],[10,20,20,40,10,0],
    [50,40,40,40,60,30,0],[50,60,30,30,30,0],[30,50,50,20,30,10,30,30,40,0],[40,30,10,5,5,5,5,0],[50,50,40,30,0],
    [40,20,10,5,2,2,1,20],[80,20,40,50,60,60,70,60,0],[30,30,20,40,60,80,50,30,20,20,70,50,0],['无']
]

#成功数量
SUCCESS_TIMES = 0
