#问卷的ID
ID = 79481885

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 80

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,1,0,1,1, 0,0,0,0,0, 0,0]

#每一题有多少个选项
SELECTION_COUNT = [2,6,2,2,2, 4,5,3,11,10, 2,5,5,5,5, 5,5]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[20,80],[95,0,5,0,0,0],[0,100],[100,0],[100,0],
[0,50,40,10],[60,70,20,30,10],[40,60,0],[30,30,30,30,100, 0,100,20,20,20, 20],[50,50,50,20,50, 30,20,50,50,50],
[30,70],[40,40,20,0,0],[15,75,10,0,0],[35,45,20,0,0],[78,22,0,0,0],
[0,0,45,30,25],[18,60,15,7,0]
]

#成功数量
SUCCESS_TIMES = 0
