#问卷的ID
ID = 52056399

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 150

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,3, 3,0,0,0,1, 0,1,3]

#每一题有多少个选项
SELECTION_COUNT = [2,4,10,2,4, 5,3,3,2,5, 3,7,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[40,60],[100,0,0,0],[40,5,5,5,5,5,10,5,10,10],[0,100],[30,30,20,20],
[0,20,50,10,20],[40,40,20],[30,30,40],[70,30],[40,60,80,70,30],
[40,40,20],[50,60,60,60,50,70,10],[]
]

#成功数量
SUCCESS_TIMES=0

answer1=["无","没有","暂时没有","暂无"]
answer2=["希望政府可以出台相应的政策法律,用以监管网购快递包装循环利用情况","菜鸟驿站在今后发展中提高服务质量,宣传包装回收利用知识","无"]
