#问卷的ID
ID = 78107627

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES =100

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵,5代表多项填空
QUESTION_TYPE = [0,0,0,0,0, 0,0,1,0,0, 0,1,0,0,0, 0,1,0,1,0, 1,3,3]

#每一题有多少个选项
SELECTION_COUNT = [2,5,11,6,5, 2,2,4,5,4, 5,6,2,5,3, 4,5,3,5,4, 5,0,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [60,40],[20,20,20,20,20],[10,10,10,10,10,10,10,10,10,10,10],[20,20,20,15,15,10],[20,20,20,20,20],
    [85,15],[70,30],[40,40,60,15],[20,40,20,15,5],[25,45,20,10],
    [10,15,30,15,30],[30,30,30,30,5,30],[60,40],[15,15,30,30,10],[60,30,10],
    [50,30,10,10],[10,60,10,10,10],[60,30,10],[30,20,15,10,5],[60,20,10,10],
    [70,20,10,0,0],['无'],['无']
]

#成功数量
SUCCESS_TIMES = 0
