#问卷的ID
ID = 81546179

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 130

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,1,1,1,0, 1,1,1,0,0]

#每一题有多少个选项
SELECTION_COUNT = [4,4,4,5,4, 5,6,6,5,4, 7,6,6,2,3]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[80,10,5,5],[20,50,20,10],[10,50,30,10],[5,10,40,30,15],[10,20,50,28],
[40,30,10,10,10],[75,77,50,50,75,10],[40,70,70,50,50,10],[30,70,70,20,20],[10,20,40,30],
[50,50,50,50,50,50,50],[30,50,70,70,20,10],[30,70,70,20,70,10],[80,20],[20,50,30]
]

#成功数量
SUCCESS_TIMES = 0
