#问卷的ID
ID = 78719739

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 2

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,1,1, 0,0,0,0,1, 0]

#每一题有多少个选项
SELECTION_COUNT = [2,5,3,4,4, 2,2,3,5,5, 3,7,3,3,5, 6]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[62,38],[9,67,15,8,1],[72,18,10],[22,49,23,6],[3,25,68,4],
[34,66],[2,98],[23,34,43],[70,80,60,50,10],[60,80,60,60,10],
[30,49,21],[0,12,76,9,2,1,0],[18,2,80],[21,26,53],[90,80,70,60,10],[2,16,41,26,12,3]
]

#成功数量
SUCCESS_TIMES=0

answer1=["无","没有","暂时没有","暂无"]
answer2=["希望政府可以出台相应的政策法律,用以监管网购快递包装循环利用情况","菜鸟驿站在今后发展中提高服务质量,宣传包装回收利用知识","无"]
