#问卷的ID
ID = 82792169

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 30

#西祠IP代理网址
IP_URL = 'https://www.kuaidaili.com/free/inha/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,1,1, 0,1,1,1,0, 3]

#每一题有多少个选项
SELECTION_COUNT = [2,4,4,4,4, 4,3,5,7,6, 5,4,6,6,4, 0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
    [30,70],[8,77,8,6],[5,10,74,8],[3,7,10,79],[14,11,23,50],
    [18,62,15,3],[24,68,7],[3,32,10,10,42],[28,39,36,22,10,20,34],[62,31,46,50,40,6],
    [37,35,12,14,1],[45,48,35,38],[61,44,60,56,63,11],[59,56,68,63,51,9],[40,46,10,3],
    ['无']
]

#成功数量
SUCCESS_TIMES = 0
