#问卷的ID
ID = 81222968

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 5

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空
QUESTION_TYPE = [0,1,0,1,1, 0,1,0,1,1, 0,1,1,1]

#每一题有多少个选项
SELECTION_COUNT = [4,7,4,5,4, 4,4,4,5,4, 4,5,8,6]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[11,76,8,5],[24,88,76,54,13,4,8],[79,10,11,0],[57,89,100,24,44],[100,100,21,3],
[21,21,43,15],[72,13,69,33],[80,18,2,0],[83,67,58,42,77],[83,85,67,34],
[0,58,0,42],[51,43,81,84,36],[93,60,83,39,45,90,54,89],[82,87,30,49,93,100]
]

#成功数量
SUCCESS_TIMES = 0
