#问卷的ID
ID = 81292759

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 250

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,0,0,0,0, 1,1,0,0,0, 0,1,0,0,0, 4,4]

#每一题有多少个选项
SELECTION_COUNT = [2,4,8,4,4, 3,4,3,4,3, 6,5,4,2,2, 2,9,4,5,4, 5,5]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[5,95],[14,24,17,45],[4,20,40,20,6,7,1,2],[1,13,50,36],[1,18,73,8],
[7,55,38],[7,46,32,15],[43,47,10],[38,56,5,1],[68,31,1],
[55,62,87,42,33,3],[72,4,90,15,1],[67,21,1,1],[83,17],[95,5],
[85,15],[99,81,28,63,4,41,16,3,1],[6,60,16,18],[18,42,25,10,5],[29,67,3,1],
[[1,0,1,7,91],[1,0,1,3,95],[0,1,8,52,39],[1,1,24,58,16],[1,2,4,80,13],[1,1,66,24,8],[1,0,20,63,16]],
[[1,1,35,47,16],[2,3,36,56,3],[1,1,8,64,26],[0,1,23,71,15],[1,3,26,55,15]]
]

#成功数量
SUCCESS_TIMES = 0
