#问卷的ID
ID = 81333073

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 95

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,1,0,1, 1,0,4,0,0, 0,0,4,0,0]

#每一题有多少个选项
SELECTION_COUNT = [2,5,7,4,6, 8,4,5,6,3, 3,5,5,5,4]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[55,45],[10,30,50,7,3],[100,34,95,8,4,13,5],[0,17,44,39],[100,40,78,21,52,4],
[82,78,30,56,91,78,34,5],[30,5,47,18],
[[10,20,20,30,20],[10,20,20,30,20],[10,20,20,30,20],[10,20,20,30,20],[10,20,20,30,20],[10,20,20,30,20],[10,20,20,30,20]],  
[30,17,30,14,5,4],[43,49,8],
[56,43,1],[3,5,13,47,32],
[[0,0,0,60,40],[30,30,10,13,17],[9,13,13,43,22],[74,9,4,13,0],[65,9,9,9,8],[43,4,26,17,10],[40,12,11,19,18]],
[18,61,8,12,1],[10,40,40,10]
]

#成功数量
SUCCESS_TIMES = 0
