#问卷的ID
ID = 79766427

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 10

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选,2代表排序，3代表填空,4代表矩阵
QUESTION_TYPE = [0,0,0,0,0, 0,1,0,1,1, 1,0,4,3]

#每一题有多少个选项
SELECTION_COUNT = [2,2,5,5,5, 4,6,5,6,7, 5,3,5,0]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [
[100,0],[30,70],[3,70,25,2,0],[67,29,1,2,1],[2,80,8,6,4],
[10,40,30,20],[70,100,50,50,40,10],[10,68,20,2,0],[70,80,50,60,60,30],[50,70,50,50,50,80,10],
[80,50,50,20,5],[50,40,10],
[[10,10,30,30,20],[10,10,30,30,20],[10,10,30,30,20],[10,10,30,30,20],[10,10,30,30,20]],
['无','没有','']
]

#成功数量
SUCCESS_TIMES = 0
