#问卷的ID
ID = 66158120

#问卷的网址
WJX_URL = "https://www.wjx.cn/jq/{}.aspx".format(ID)

#回答问卷的次数
ANSWER_TIMES = 230

#西祠IP代理网址
IP_URL = 'https://www.xicidaili.com/nn/'

#生成问卷的方式，r代表随机生成，p代表根据配置的概率生成，l代表有联动题目的生成
MODE = 'p'

#概率生成需要填充的常量
#每一题是单选还是多选，0代表单选，1代表多选
QUESTION_TYPE = [0,0,0,0,0,1,1,0,0,1,0,0,1,0]

#每一题有多少个选项
SELECTION_COUNT = [2,3,5,2,5,6,7,3,2,3,2,3,3,2]

#每个选项的概率，是一个二维列表
SELECTION_PORBABILITY = [[50,50],[40,40,20],[50,30,10,7,3],[40,60],[10,30,30,20,10],[70,80,50,60,40,10],[70,50,70,60,60,50,10],[60,20,20],[70,30],[30,60,70],[70,30],[60,20,20],[60,70,70],[80,20]]
